driver-tests/bpelse/assign/AssignJbi/test/results/CopydecimalInvoke/Actual_20130314183821_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <decimalPart xmlns="urn:DataType" xmlns:msgns="urn:CopyDataTypeTNS">
      <xsd_decimal>10.00005</xsd_decimal>
      <optional_decimal>1.05005</optional_decimal>
      <repeat_decimal>1.05005</repeat_decimal>
      <repeat_decimal>10.00505</repeat_decimal>
    </decimalPart>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>